:PROPERTIES:
:ID:       16242e22-1af0-4aaf-a206-4ba77e6c74f1
:END:
#+title: C Function Pointers

A function pointer is a pointer that holds the address of a function.

One concern regarding the use of function pointers is a potentially slower running program. The processor may not be able to use /branch prediction/ in conjunction with /pipelining/.

=Branch prediction= is a technique whereby the processor will guess which multiple execution sequences will be executed.

=Pipelining= is a hardware technology commonly used to improve processor performance and is achieved by overlapping instruction execution.

* Declaring Function Pointers
Below, we declare a pointer to a function that
is passed void and returns void:

#+begin_src C
   void (*foo)();
#+end_src

* Using a Function Pointer

To use the function pointer to execute the square function, we need to assign the square function’s address to the function pointer, as shown below.

As with array names, when we use the name of a function by itself, it returns the function’s address.

#+begin_src C
  #include <stdio.h>
  int (*fptr1)(int);
  int square(int num) {
    return num*num;
  }
  int main(){
    int n = 5;
    fptr1 = square;
    printf("%d squared is %d\n",n, fptr1(n));
  }
#+end_src

#+RESULTS:
: 5 squared is 25

It is convenient to declare a type definition for function pointers. /Note: the Syntax of Typedef is unusual./
#+begin_src C
  typedef int (*funcptr)(int);
  //...
  funcptr fptr2;
  fptr2 = square;
  printf("%d squared is %d\n",n, fptr2(n));
#+end_src

* Crude Example
#+begin_src C
  #include <stdio.h>

  typedef int (*operation_ptr) (int,int);

  int add(int x,int y){return x+y;}
  int mult(int x,int y){return x*y;}

  int do_opr(operation_ptr op,int a,int b){
    return op(a,b);
  }

  int main(){
    printf("%d\n",do_opr(add,3,5));
    printf("%d",do_opr(mult,3,5));
  }
#+end_src

#+RESULTS:
|  8 |
| 15 |
